{
  "posts": [
//    {
//      "title": "Why Moroccans SMES should use odoo?",
//      "slug": "why-moroccan-smes-should-use-odoo",
//      "date": "2026-01-02",
//      "excerpt": "Here is the truth about running a small to medium-sized enterprise (SME) in Morocco today"
//    },
//    {
//      "title": "The Kenitra Paradox: When the Engine is a Ferrari, but the Chassis is a Dacia",
//      "slug": "the-kenitra-paradox",
//      "date": "2026-01-02",
//      "excerpt": "Let’s pour a glass of tea—the proper kind, dark and sweet, with enough..."
//    },
    {
      "title": "What is a Man Worth Before the Sun Comes Up in?",
      "slug": "what-is-a-man-worth-before-the-sun-comes-up",
      "date": "2025-12-28",
      "excerpt": "It is 4:15 AM. The time of night when the soul is most permeable, when the barrier between the waking world and the dream world is thin as ..."
    },
    {
      "title": "Labor exploitation of moroccan women in spain's agricultural industry",
      "slug": "labor-exploitation-of-moroccan-women-in-spain-s-agricultural-industry",
      "date": "2025-12-27",
      "excerpt": "It is late December in Casablanca. The air has that crisp, Atlantic bite to it, and the cafes are full of people wrapped in coats, nursing..."
    },
    {
      "title": "The CPGE system in Morocco",
      "slug": "the-cpge-system-in-morocco",
      "date": "2025-12-26",
      "excerpt": "It is 5:30 AM on a cold November Tuesday in Rabat, or perhaps Fez, or Marrakech. The city is still sleeping, wrapped in that peculiar, damp Atlantic chill. But inside thousands of small, cramped rooms across ..."
    },
    {
      "title": "Good programmers copy code, great programmers steal ideas",
      "slug": "good-programmers-copy-code-great-programmers-steal-ideas",
      "date": "2025-12-24",
      "excerpt": "There is a rather cheeky aphorism often attributed to Pablo Picasso, though T.S. Eliot probably said it better, and Steve Jobs definitely said it loudest..."
    },
    {
      "title": "Why does the Baccalaureate in Morocco feel like a life-or-death sentence?",
      "slug": "why-does-the-baccalaureate-in-morocco-feel-like-a-life-or-death-sentence",
      "date": "2025-12-22",
      "excerpt": "It is June in Morocco. The temperature is rising, the days are stretching out, and across ..."
    },
    {
      "title": "Why do we haggle over 2 dirhams with a vegetable seller but pay full price at Zara",
      "slug": "why-do-we-haggle-over-2-dirhams-with-a-vegetable-seller-but-pay-full-price-at-zara",
      "date": "2025-12-14",
      "excerpt": "There is a specific, tragicomical pantomime that occurs every Saturday morning across Morocco. It happens in the narrow, sun-drenched alleys of the medinas and the chaotic sprawls of the weekly..."
    },
    {
      "title": "Why does the Public Hospital in Morocco Smells Like Bleach and Despair",
      "slug": "why-does-the-public-hospital-in-morocco-smell-like-bleach-and-despair",
      "date": "2025-12-13",
      "excerpt": "There is a specific scent that hits you the moment you cross the threshold of a Moroccan public hospital—let’s say, ...."
    },
    {
      "title": "The Samsar of the Soul: Why Truth in Morocco Always Needs a Middleman",
      "slug": "why-does-the-truth-in-morocco-always-require-a-middleman",
      "date": "2025-12-12",
      "excerpt": "If you have ever stood in a Moroccan administrative line—clutching a plastic folder containing your birth certificate, two photos on a white background, and the palpable fear of God—you know the feeli..."
    }
  ]
}
